// See https://aka.ms/new-console-template for more information

// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// int a = int.Parse(Console.ReadLine());
// int b = int.Parse(Console.ReadLine());
// if (a > b)
// {
//     Console.WriteLine(a + " - больше");
// }
// else if (a < b)
// {
//     Console.WriteLine(b + " - больше");
// }
// else
// {
//     Console.WriteLine("Числа ровны");
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// int a = int.Parse(Console.ReadLine());
// int b = int.Parse(Console.ReadLine());
// int c = int.Parse(Console.ReadLine());
// int max = a;
// if (b > max)
// {
//     max = b;
// }
// if (c > max)
// {
//     max = c;
// }
// Console.WriteLine(max + " - максимальное число");

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// int a = int.Parse(Console.ReadLine());
// if (a % 2 == 0)
// {
//     Console.WriteLine(a + " - четное");
// }
// else
// {
//     Console.WriteLine(a + " - нечетное");
// }

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// int a = int.Parse(Console.ReadLine());
// int i = 1;

// while (i < a) // Не включая N
// {
//     if (i % 2 == 0)
//     {
//         Console.WriteLine(i);
//     }
//     i++;
// }